tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1527_tdd.h
#define SSP2CON1_CKP                  522
#define SSP2CON1_SSPEN                523
#define SSP2CON1_SSPOV                524
#define SSP2CON1_WCOL                 525
#define SSP2CON2                      526
#define SSP2CON2_SEN                  527
#define SSP2CON2_RSEN                 528
#define SSP2CON2_PEN                  529
#define SSP2CON2_RCEN                 530
#define SSP2CON2_ACKEN                531
#define SSP2CON2_ACKDT                532
#define SSP2CON2_ACKSTAT              533
#define SSP2CON2_GCEN                 534
#define SSP2CON3                      535
#define SSP2CON3_DHEN                 536
#define SSP2CON3_AHEN                 537
#define SSP2CON3_SBCDE                538
#define SSP2CON3_SDAHT                539
#define SSP2CON3_BOEN                 540
#define SSP2CON3_SCIE                 541
#define SSP2CON3_PCIE                 542
#define SSP2CON3_ACKTIM               543
#define PORTF                         544
#define RF0                           545
#define RF1                           546
#define RF2                           547
#define RF3                           548
#define RF4                           549
#define RF5                           550
#define RF6                           551
#define RF7                           552
#define PORTG                         553
#define RG0                           554
#define RG1                           555
#define RG2                           556
#define RG3                           557
#define RG4                           558
#define RG5                           559
#define CCPR1L                        560
#define CCPR1H                        561
#define CCP1CON                       562
#define CCP1M0                        563
#define CCP1M                         564
#define CCP1M1                        565
#define CCP1M2                        566
#define CCP1M3                        567
#define DC1B                          568
#define DC1B0                         569
#define DC1B1                         570
#define CCPR2L                        571
#define CCPR2H                        572
#define CCP2CON                       573
#define CCP2M                         574
#define CCP2M0                        575
#define CCP2M1                        576
#define CCP2M2                        577
#define CCP2M3                        578
#define DC2B0                         579
#define DC2B                          580
#define DC2B1                         581
#define CCPTMRS0                      582
#define C1TSEL0                       583
#define C1TSEL                        584
#define C1TSEL1                       585
#define C2TSEL0                       586
#define C2TSEL                        587
#define C2TSEL1                       588
#define C3TSEL0                       589
#define C3TSEL                        590
#define C3TSEL1                       591
#define C4TSEL                        592
#define C4TSEL0                       593
#define C4TSEL1                       594
#define CCPTMRS1                      595
#define C5TSEL                        596
#define C5TSEL0                       597
#define C5TSEL1                       598
#define C6TSEL0                       599
#define C6TSEL                        600
#define C6TSEL1                       601
#define C7TSEL                        602
#define C7TSEL0                       603
#define C7TSEL1                       604
#define C8TSEL0                       605
#define C8TSEL                        606
#define C8TSEL1                       607
#define CCPTMRS2                      608
#define C9TSEL                        609
#define C9TSEL0                       610
#define C9TSEL1                       611
#define C10TSEL0                      612
#define C10TSEL                       613
#define C10TSEL1                      614
#define TRISF                         615
#define TRISF0                        616
#define TRISF1                        617
#define TRISF2                        618
#define TRISF3                        619
#define TRISF4                        620
#define TRISF5                        621
#define TRISF6                        622
#define TRISF7                        623
#define TRISG                         624
#define TRISG0                        625
#define TRISG1                        626
#define TRISG2                        627
#define TRISG3                        628
#define TRISG4                        629
#define CCPR3L                        630
#define CCPR3H                        631
#define CCP3CON                       632
#define CCP3M                         633
#define CCP3M0                        634
#define CCP3M1                        635
#define CCP3M2                        636
#define CCP3M3                        637
#define DC3B                          638
#define DC3B0                         639
#define DC3B1                         640
#define CCPR4L                        641
#define CCPR4H                        642
#define CCP4CON                       643
#define CCP4M                         644
#define CCP4M0                        645
#define CCP4M1                        646
#define CCP4M2                        647
#define CCP4M3                        648
#define DC4B0                         649
#define DC4B                          650
#define DC4B1                         651
#define CCPR5L                        652
#define CCPR5H                        653
#define CCP5CON                       654
#define CCP5M0                        655
#define CCP5M                         656
#define CCP5M1                        657
#define CCP5M2                        658
#define CCP5M3                        659
#define DC5B0                         660
#define DC5B                          661
#define DC5B1                         662
#define LATF                          663
#define LATF0                         664
#define LATF1                         665
#define LATF2                         666
#define LATF3                         667
#define LATF4                         668
#define LATF5                         669
#define LATF6                         670
#define LATF7                         671
#define LATG                          672
#define LATG0                         673
#define LATG1                         674
#define LATG2                         675
#define LATG3                         676
#define LATG4                         677
#define IOCBP                         678
#define IOCBP0                        679
#define IOCBP1                        680
#define IOCBP2                        681
#define IOCBP3                        682
#define IOCBP4                        683
#define IOCBP5                        684
#define IOCBP6                        685
#define IOCBP7                        686
#define IOCBN0                        687
#define IOCBN                         688
#define IOCBN1                        689
#define IOCBN2                        690
#define IOCBN3                        691
#define IOCBN4                        692
#define IOCBN5                        693
#define IOCBN6                        694
#define IOCBN7                        695
#define IOCBF0                        696
#define IOCBF                         697
#define IOCBF1                        698
#define IOCBF2                        699
#define IOCBF3                        700
#define IOCBF4                        701
#define IOCBF5                        702
#define IOCBF6                        703
#define IOCBF7                        704
#define ANSELF                        705
#define ANSF0                         706
#define ANSF1                         707
#define ANSF2                         708
#define ANSF3                         709
#define ANSF4                         710
#define ANSF5                         711
#define ANSF6                         712
#define ANSF7                         713
#define ANSELG                        714
#define ANSG1                         715
#define ANSG2                         716
#define ANSG3                         717
#define ANSG4                         718
#define TMR3L                         719
#define TMR3H                         720
#define T3CON                         721
#define TMR3ON                        722
#define nT3SYNC                       723
#define T3OSCEN                       724
#define T3CON_SOSCEN                  725
#define T3CKPS                        726
#define T3CKPS0                       727
#define T3CKPS1                       728
#define TMR3CS0                       729
#define TMR3CS                        730
#define TMR3CS1                       731
#define T3GCON                        732
#define T3GSS0                        733
#define T3GSS                         734
#define T3GSS1                        735
#define T3GVAL                        736
#define T3GGO_nDONE                   737
#define T3GSPM                        738
#define T3GTM                         739
#define T3GPOL                        740
#define TMR3GE                        741
#define TMR4                          742
#define PR4                           743
#define T4CON                         744
#define T4CKPS0                       745
#define T4CKPS                        746
#define T4CKPS1                       747
#define TMR4ON                        748
#define T4OUTPS                       749
#define T4OUTPS0                      750
#define T4OUTPS1                      751
#define T4OUTPS2                      752
#define T4OUTPS3                      753
#define TMR5L                         754
#define TMR5H                         755
#define T5CON                         756
#define TMR5ON                        757
#define nT5SYNC                       758
#define T5OSCEN                       759
#define T5CON_SOSCEN                  760
#define T5CKPS                        761
#define T5CKPS0                       762
#define T5CKPS1                       763
#define TMR5CS0                       764
#define TMR5CS                        765
#define TMR5CS1                       766
#define T5GCON                        767
#define T5GSS                         768
#define T5GSS0                        769
#define T5GSS1                        770
#define T5GVAL                        771
#define T5GGO_nDONE                   772
#define T5GSPM                        773
#define T5GTM                         774
#define T5GPOL                        775
#define TMR5GE                        776
#define TMR6                          777
#define PR6                           778
#define T6CON                         779
#define T6CKPS0                       780
#define T6CKPS                        781
#define T6CKPS1                       782
#define TMR6ON                        783
#define T6OUTPS0                      784
#define T6OUTPS                       785
#define T6OUTPS1                      786
#define T6OUTPS2                      787
#define T6OUTPS3                      788
#define WPUG                          789
#define WPUG5                         790
#define RC2REG                        791
#define TX2REG                        792
#define SP2BRGL                       793
#define SP2BRGH                       794
#define RC2STA                        795
#define RC2STA_RX9D                   796
#define RC2STA_OERR                   797
#define RC2STA_FERR                   798
#define RC2STA_ADDEN                  799
#define RC2STA_CREN                   800
#define RC2STA_SREN                   801
#define RC2STA_RX9                    802
#define RC2STA_SPEN                   803
#define TX2STA                        804
#define TX2STA_TX9D                   805
#define TX2STA_TRMT                   806
#define TX2STA_BRGH                   807
#define TX2STA_SENDB                  808
#define TX2STA_SYNC                   809
#define TX2STA_TXEN                   810
#define TX2STA_TX9                    811
#define TX2STA_CSRC                   812
#define BAUD2CON                      813
#define BAUD2CON_ABDEN                814
#define BAUD2CON_WUE                  815
#define BAUD2CON_BRG16                816
#define BAUD2CON_SCKP                 817
#define BAUD2CON_RCIDL                818
#define BAUD2CON_ABDOVF               819
#define TMR8                          820
#define PR8                           821
#define T8CON                         822
#define T8CKPS0                       823
#define T8CKPS                        824
#define T8CKPS1                       825
#define TMR8ON                        826
#define T8OUTPS                       827
#define T8OUTPS0                      828
#define T8OUTPS1                      829
#define T8OUTPS2                      830
#define T8OUTPS3                      831
#define TMR10                         832
#define PR10                          833
#define T10CON                        834
#define T10CKPS                       835
#define T10CKPS0                      836
#define T10CKPS1                      837
#define TMR10ON                       838
#define T10OUTPS0                     839
#define T10OUTPS                      840
#define T10OUTPS1                     841
#define T10OUTPS2                     842
#define T10OUTPS3                     843
#define CCPR6L                        844
#define CCPR6H                        845
#define CCP6CON                       846
#define CCP6M                         847
#define CCP6M0                        848
#define CCP6M1                        849
#define CCP6M2                        850
#define CCP6M3                        851
#define DC6B0                         852
#define DC6B                          853
#define DC6B1                         854
#define CCPR7L                        855
#define CCPR7H                        856
#define CCP7CON                       857
#define CCP7M0                        858
#define CCP7M                         859
#define CCP7M1                        860
#define CCP7M2                        861
#define CCP7M3                        862
#define DC7B                          863
#define DC7B0                         864
#define DC7B1                         865
#define CCPR8L                        866
#define CCPR8H                        867
#define CCP8CON                       868
#define CCP8M0                        869
#define CCP8M                         870
#define CCP8M1                        871
#define CCP8M2                        872
#define CCP8M3                        873
#define DC8B0                         874
#define DC8B                          875
#define DC8B1                         876
#define CCPR9L                        877
#define CCPR9H                        878
#define CCP9CON                       879
#define CCP9M0                        880
#define CCP9M                         881
#define CCP9M1                        882
#define CCP9M2                        883
#define CCP9M3                        884
#define DC9B0                         885
#define DC9B                          886
#define DC9B1                         887
#define CCPR10L                       888
#define CCPR10H                       889
#define CCP10CON                      890
#define CCP10M                        891
#define CCP10M0                       892
#define CCP10M1                       893
#define CCP10M2                       894
#define CCP10M3                       895
#define DC10B0                        896
#define DC10B                         897
#define DC10B1                        898
#define STATUS_SHAD                   899
#define C_SHAD                        900
#define DC_SHAD                       901
#define Z_SHAD                        902
#define WREG_SHAD                     903
#define BSR_SHAD                      904
#define PCLATH_SHAD                   905
#define FSR0L_SHAD                    906
#define FSR0H_SHAD                    907
#define FSR1L_SHAD                    908
#define FSR1H_SHAD                    909
#define STKPTR                        910
#define TOSL                          911
#define TOSH                          912

#endif // _PIC16F1527_H_
